OpenFOAM-13/tutorials/incompressibleVoF/floatingObject/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication subsetMesh -noFields

runApplication setFields

runApplication decomposePar -cellProc
runParallel foamRun
runApplication reconstructPar -cellProc

#------------------------------------------------------------------------------
